m_start = 'سلام!\nشما وارد چت دوستیابی ناشناس شدید!\n' \
               'بر روی دکمه زیر کلیک کنید تا گپ و گفتگوی خود را آغاز کنید.' \
               'اگر می خواهید شخصی را بهتر بشناسید - دکمه پسندیدن و با همدردی متقابل را فشار دهید ' \
               'شما می توانید نام مستعار شریک زندگی را پیدا کنید. اگر گفتگوی مورد علاقه شما نیست, ' \
               'سپس در صورت تمایل دکمه dislike را فشار داده و گپ جدیدی را شروع کنید.\n' \
               'توجه! برای اینکه ربات با موفقیت کار کند ، باید یک نام مستعار داشته باشید, ' \
               'تنظیمات را بررسی کنید و مطمئن شوید که آن را در لیست قرار داده اید!\n' \
               'برای خاموش کردن ربات این را بزنید /stop. ' \

m_is_not_free_users = 'با عرض پوزش ، اما در حال حاضر هیچ کاربر آزادی وجود ندارد. ' \
                   'به محض ورود کاربر دیگری ، ما شما را متصل خواهیم کرد!'
m_is_connect = 'ارتباط برقرار شده است سلام کنید!'

m_play_again = 'می خواهید با شخص دیگری گپ بزنید؟'

m_is_not_user_name = 'متأسفیم ، اما در ربات ما فقط در صورت داشتن نام کاربری امکان برقراری ارتباط وجود دارد'

m_good_bye = 'ربات: خداحافظ ، خوشحال خواهیم شد که دوباره شما را می بینیم!'

m_disconnect_user = 'ربات: گفتگوی شما قطع شده است'

m_failed = 'ربات: نوعی خطا رخ داده است!'

m_like = 'ربات: انتخاب عالی!'

m_dislike_user = 'ربات: گفتگو پایان یافت'

m_dislike_user_to = 'ربات: طرف مقابل از شما خوشش نیامد'

m_send_some_messages = 'ربات: شما نمی توانید پیام های خود را فوروارد کنید'

m_has_not_dialog = 'شما در گفتگو نیستید'

dislike_str = '\U0001F44E خوشم نیومد'

like_str = '\U0001F44D خوب بود'


def m_all_like(x):
    return 'ازت خوشش اومدا!' + 'یوزرنیمش اینه: ' + str(x) + \
           '\nبازم بیا سمیش کنیم!'
